/*
    Localizable.strings
    SuspiciousPackage

    Created by Randy Saldinger on 2/19/08.
    Copyright (c) 2008 Mothers Ruin Software. All rights reserved.
 */

/* object types */
"TYPE_MRSProductTypeAppleSoftwareUpdateComponent" = "Apple Software Update Package";
"TYPE_MRSProductTypeAppleSoftwarePackage" = "Apple Installer Package";
"TYPE_MRSProductTypeAppleSoftwarePrereleasePackage" = "Apple Pre-release Installer Package";
"TYPE_MRSProductTypeAppStorePackage" = "Mac App Store Package";
"TYPE_MRSProductTypeAppStoreTestPackage" = "Mac App Store Test Package";
"TYPE_MRSProductTypeDeveloperIDPackage" = "Developer ID Installer Package";
"TYPE_MRSProductTypeGenericPackage" = "Installer Package";
"TYPE_MRSProductTypeUnsupportedPackage" = "Archaic or Damaged Installer Package";
"TYPE_MRSProductTypeBOMReceipt" = "Installer Receipt";
"TYPE_MRSProductTypeBOMFile" = "Installer Bill of Materials";

/* object type details */
"EXPLAIN_MRSProductTypeAppleSoftwareUpdateComponent" = "This is an OS X software update package, and was signed by Apple (as shown below). OS X downloads such packages automatically — to the /Library/Updates folder — and offers to install them from the Updates page of the Mac App Store.";
"EXPLAIN_MRSProductTypeAppleSoftwarePackage" = "This package contains OS X updates or other Apple software, and was signed by Apple (as shown below). This package will open with the OS X Installer application.";
"EXPLAIN_MRSProductTypeAppleSoftwarePrereleasePackage" = "This is a package containing pre-release versions of OS X updates or other Apple software. It was signed by Apple (as shown below) but not intended for general distribution.";
"EXPLAIN_MRSProductTypeAppStorePackage" = "This is a package signed by Apple (as shown below), for delivery of software from the Mac App Store. This package may contain Apple or third-party software.";
"EXPLAIN_MRSProductTypeAppStoreTestPackage" = "This is a test package signed by Apple (as shown below), for delivery through a QA version of the Mac App Store.";
"EXPLAIN_MRSProductTypeDeveloperIDPackage" = "This is a package signed by a third-party developer, using a Developer ID certificate obtained from Apple (under the Gatekeeper program). See below for details of the Developer ID signature.</p><p>This package will open with the OS X Installer application, provided that your Security &amp; Privacy preferences (in System Preferences) are configured to allow “applications downloaded from Mac App Store and identified developers.”";
"EXPLAIN_MRSProductTypeGenericPackage" = "This is a package that will open with the OS X Installer application.";
"EXPLAIN_MRSProductTypeUnsupportedPackage" = "This is a package that is not understood by Suspicious Package, but that may still be usable by the OS X Installer application. The OS X Installer supports a bewildering array of package formats, going back to NeXT days. This might be a valid package, but Suspicious Package can't help interpret it.";
"EXPLAIN_MRSProductTypeBOMReceipt" = "This is a “receipt” created by the OS X Installer application, as a result of installing a previous package. A receipt contains only limited information about the files that the package might have installed, and some paths may be incorrect. Use with caution.";
"EXPLAIN_MRSProductTypeBOMFile" = "This is a “bill of materials“ file, which is a file manifest typically used for installer packages and installer “receipts.”";

/* install properties */
"ACTION_LOGOUT" = "Log Out Required";
"ACTION_RESTART" = "Restart Required";
"ACTION_SHUTDOWN" = "Shut Down Required";
"ALLOWS_HOME_DIRECTORY_INSTALL" = "Can be installed into user's home folder";

/* signature and certificates */
"CERT_NAME_UNAVAILABLE" = "Unknown";
"CERT_IS_ROOT_CA" = "Root certificate authority";
"CERT_IS_INTERMEDIATE_CA" = "Intermediate certificate authority";
"CERT_DATE_LABEL_DID_EXPIRE" = "Expired";
"CERT_DATE_LABEL_VALID_AS_OF_TODAY" = "Expires";
"CERT_DATE_LABEL_NOT_YET_VALID" = "Not Valid Until";
"CERT_STATUS_TRUSTED_MACHINE" = "This certificate is marked as trusted for all users";
"CERT_STATUS_TRUSTED_USER" = "This certificate is marked as trusted for this account";
"CERT_STATUS_VALID" = "This certificate is valid";
"CERT_STATUS_EXPIRED" = "This certificate has expired";
"CERT_STATUS_NOT_YET_VALID" = "This certificate is not yet valid";
"CERT_STATUS_REVOKED" = "This certificate has been revoked";
"CERT_STATUS_NOT_TRUSTED" = "This certificate was signed by an untrusted issuer";
"CERT_STATUS_ROOT_NOT_TRUSTED" = "This root certificate is not trusted";

/* install scripts and related */
"ONE_SCRIPT" = "Runs 1 install script";
"N_SCRIPTS" = "Runs %@ install scripts";
"BINARY_SCRIPT" = "Script is a binary executable or other non-text file";
"ARG0_DESC" = "path to script “%@”";
"ARG1_DESC" = "path to package";
"ARG2_DESC" = "“%@” on selected install disk";
"ARG2_DESC_COMP" = "path to “%@” (possibly an existing copy)";
"ARG3_DESC" = "path for selected install disk";
"ARG4_DESC" = "“/” on startup disk";
"INVOKE_INFO_PREINSTALL" = "Script is run by Installer, as the <strong>root</strong> user, <em>before</em> moving files into place.";
"INVOKE_INFO_POSTINSTALL" = "Script is run by Installer, as the <strong>root</strong> user, <em>after</em> moving files into place.";
"INVOKE_INFO_PREACTIONS" = "Script is likely run by the “preinstall” script <em>before</em> moving files into place. (The “preinstall_actions” folder is a convention in Apple packages.)";
"INVOKE_INFO_POSTACTIONS" = "Script is likely run by the “postinstall” script <em>after</em> moving files into place. (The “postinstall_actions” folder is a convention in Apple packages.)";
"INVOKE_INFO_DEFERRED" = "Script is run by OS X, as the <strong>root</strong> user, immediately before the computer restarts, in order to update important system files.";
"INVOKE_INFO_NON_REFERENCED" = "File is not <em>directly</em> used by the Installer, but is probably referenced by another script in this package.";
"READ_MORE_URL_NON_REFERENCED" = "http://www.mothersruin.com/software/SuspiciousPackage/faq.html#non-referenced-scripts";
"INVOKE_INFO_SYSTEM_RUN" = "Script <em>may</em> be run, as the current user, when package is opened in Installer. This occurs once you click Continue from the alert that “this package will run a program to determine if the software can be installed.”";
"PRODUCT_SCRIPT_CONTAINER" = "Main Package";

/* payload */
"VERS_COMBINED" = "Version %@ (%@)";
"VERS_SINGLE" = "Version %@";
"VERS_SOURCE" = "Source version %@";
"NO_PAYLOAD_PACKAGE" = "This package does not install any files.";
"DID_OMIT_FILES" = "This package installs more than %@ files. Items more than %@ folders deep are not shown below. These folders are marked by the <span class=\"inline-icon icon_opaque_folder\">icon</span>.";

/* receipts */
"PROC_SWU" = "OS X Software Update";
"PROC_APPSTORE" = "Mac App Store";
"PROC_OSINSTALLER" = "OS X Installer";
"PROC_INSTALLER" = "OS X Installer";
"PROC_CLI_INSTALLER" = "/usr/sbin/installer";
"PROC_XCODE" = "Xcode";
"PROC_MIG" = "Migration Assistant";
"PROC_UNKNOWN" = "unknown process";
